app/controllers/comments_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "nhat"], ["body", "ok nha"], ["product_id", 1], ["created_at", "2021-05-18 14:15:52.045408"], ["updated_at", "2021-05-18 14:15:52.045408"]]
---
    def create
        @product = Product.find(params[:id])
        @comment = @product.comments.create(comment_params)