app/controllers/products_controller.rb

SELECT "products".* FROM "products"
INSERT INTO "products" ("name", "price", "size", "color", "brand", "seller", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def search
      @products = Array.new
      @key = params[:key]
      @brand = params[:brand]
      temp = Product.all
      if (@brand == "all") | (@brand == "") |(@brand == nil)
        temp.each do |item|
          if ((item.name.downcase.include?(@key.downcase))||(item.color.downcase.include?(@key.downcase)))
            @products << item
          end
        end
      else
        temp.each do |item|
          if ((item.name.downcase.include?(@key.downcase))||(item.color.downcase.include?(@key.downcase))) &
            (item.brand.downcase == @brand.downcase)
            @products << item

INSERT INTO "products" ("name", "price", "size", "color", "brand", "seller", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @product = Product.new(product_params)
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Hello"], ["updated_at", "2021-06-16 11:06:37.439581"], ["id", 1]]
---
    def update
      @product = Product.find(params[:id])

      if @product.update(product_params)