app/views/products/show.html.erb

            </table>
<%@product.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ? LIMIT ?  [["product_id", 4], ["LIMIT", 1]]